{
  "single_purpose": {
    "zh": "本扩展的单一用途是过滤X(Twitter)平台上的可疑水军账号和垃圾内容。通过自动识别和屏蔽自动化运营账号、包含敏感关键词的推文以及可疑用户名，帮助用户获得更清净的浏览体验。",
    "en": "The single purpose of this extension is to filter suspicious bot accounts and spam content on X (Twitter) platform. It helps users achieve a cleaner browsing experience by automatically identifying and blocking automated accounts, tweets containing sensitive keywords, and suspicious usernames."
  },
  "permission_justifications": {
    "storage": {
      "zh": "用于存储用户的过滤配置，包括：手动添加的屏蔽账号列表、关键词列表、用户名列表、白名单设置、过滤开关状态以及拦截统计数据。这些数据完全存储在用户本地，用于在浏览会话之间保持用户的个性化设置。",
      "en": "Used to store user's filter configurations including: manually added blocked accounts list, keywords list, usernames list, whitelist settings, filter toggle states, and blocking statistics. All data is stored locally on the user's device to maintain personalized settings across browsing sessions."
    },
    "alarms": {
      "zh": "用于定期从远程服务器更新过滤数据列表。扩展每小时自动检查一次更新，以确保用户获得最新的水军账号和敏感关键词识别数据，无需用户手动刷新。",
      "en": "Used to periodically update filter data lists from remote servers. The extension automatically checks for updates every hour to ensure users have the latest bot account and sensitive keyword identification data without manual refresh."
    },
    "host_permissions": {
      "https://6551.tos-cn-hongkong.volces.com/*": {
        "zh": "用于下载过滤数据文件（WASM账号数据和JSON关键词数据）。这些文件包含已识别的可疑水军账号列表和敏感关键词列表，是扩展核心过滤功能的数据来源。",
        "en": "Used to download filter data files (WASM account data and JSON keyword data). These files contain identified suspicious bot account lists and sensitive keyword lists, which are the data source for the extension's core filtering functionality."
      },
      "https://ai.6551.io/*": {
        "zh": "用于接收用户的手动上报和误报反馈。当用户发现新的水军账号或认为某个账号被误判时，可以通过此接口提交反馈，帮助改进过滤准确性。",
        "en": "Used to receive user's manual reports and false positive feedback. When users discover new bot accounts or believe an account is wrongly identified, they can submit feedback through this API to help improve filtering accuracy."
      }
    },
    "content_scripts": {
      "https://twitter.com/*": {
        "zh": "需要在Twitter页面上运行内容脚本，以实时检测和过滤推文内容。脚本会分析页面上的推文，识别并隐藏来自可疑账号的内容，同时提供显示原文的选项。",
        "en": "Needs to run content scripts on Twitter pages to detect and filter tweets in real-time. The script analyzes tweets on the page, identifies and hides content from suspicious accounts, while providing an option to show the original content."
      },
      "https://x.com/*": {
        "zh": "需要在X(原Twitter)页面上运行内容脚本，以实时检测和过滤推文内容。脚本会分析页面上的推文，识别并隐藏来自可疑账号的内容，同时提供显示原文的选项。",
        "en": "Needs to run content scripts on X (formerly Twitter) pages to detect and filter tweets in real-time. The script analyzes tweets on the page, identifies and hides content from suspicious accounts, while providing an option to show the original content."
      }
    }
  },
  "privacy_practices": {
    "data_collection": {
      "zh": "本扩展不收集任何用户个人数据。所有过滤配置和统计数据仅存储在用户本地设备上。唯一与服务器通信的情况是：1) 下载公共过滤数据列表；2) 用户主动提交的账号上报或误报反馈（仅包含账号名称）。",
      "en": "This extension does not collect any personal user data. All filter configurations and statistics are stored only on the user's local device. The only server communications are: 1) Downloading public filter data lists; 2) User-initiated account reports or false positive feedback (containing only account names)."
    },
    "data_usage": {
      "zh": "下载的过滤数据仅用于在用户浏览X/Twitter时识别和过滤可疑内容。用户提交的反馈数据仅用于改进过滤列表的准确性。",
      "en": "Downloaded filter data is only used to identify and filter suspicious content while users browse X/Twitter. User-submitted feedback data is only used to improve the accuracy of filter lists."
    }
  }
}
